Revit 2027 API
IExternalServer.GetVendorId Method
 Implement this method to return the id of the vendor of the server.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetVendorId()
Function GetVendorId As String
String^ GetVendorId()
abstract GetVendorId : unit -> string
Return Value
String
 Vendor Id of the server.
Remarks
 The Id is expected to be a string consisting of 4 characters.
See Also
Reference
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace